app/views/users/show.html.erb

    <tr>
      <td><%= @user.microposts.first.content%>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY "microposts"."id" ASC LIMIT $2  [["user_id", 4], ["LIMIT", 1]]


<%= link_to 'Show', @user.microposts.first %>
<%= link_to 'Edit', edit_micropost_path(@user.microposts.first) %>
<%= link_to 'Destroy', @user.microposts.first, method: :delete, data: { confirm: 'Are you sure?' } %>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY "microposts"."id" ASC LIMIT $2  [["user_id", 4], ["LIMIT", 1]]